#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Author: 钉钉或微信pythontesting 钉钉群21734177 
# CreateDate: 2019-2-21

import collections
from bidict import bidict

from ganzhi import *

xingxius = {
    0: ('角', ""),
    1: ('亢', ""),
    2: ('氐', ""),
    3: ('房', ""),    
    4: ('心', ""),
    5: ('尾', ""),
    6: ('箕', ""),
    7: ('斗', ""),   
    8: ('牛', ""),
    9: ('女', ""),
    10: ('虚', ""),
    11: ('危', ""), 
    12: ('室', ""),
    13: ('壁', ""),
    14: ('奎', ""),
    15: ('娄', ""),    
    16: ('胃', ""),
    17: ('昴', ""),
    18: ('毕', ""),
    19: ('觜', ""),    
    20: ('参', ""),
    21: ('井', ""),
    22: ('鬼', ""),
    23: ('柳', ""),   
    24: ('星', ""),
    25: ('张', ""),
    26: ('翼', ""),
    27: ('轸', ""),      
}

jianchus = {
    0: ('建', "气专而强，宜官府公事等。 宜：赴任、祈福、求嗣、求财、交涉、出行。 忌：上梁、嫁娶、安葬。"),
    1: ('除', "除旧布新的日子。 宜：祭祀、祈福、嫁娶、出行、入宅、动土、开光、交易。 忌：嫁娶、探病。"),
    2: ('满', "丰收之意。 宜：嫁娶、祈福、出行、安床、求财、裁衣、祭祀。 忌：造葬、赴任、求医。"),
    3: ('平', "普通的日子。 宜：修造、粉刷墙壁、修补。 忌：出行。"),    
    4: ('定', "月令三合的日子。 宜：祭祀、祈福、嫁娶、造屋、求嗣、纳财。 忌：诉讼、出行、交涉。"),
    5: ('执', "守成之意。 宜：纳采、嫁娶、动土、入殓。 忌：入宅、开市。"),
    6: ('破', "日月相冲，曰大耗，诸事不宜。 宜：破屋坏垣 忌：不宜诸吉事。"),
    7: ('危', "吉事不取的日子。 宜：入殓、破土、火化、进塔、安葬。 忌：入宅嫁娶诸吉事。"),   
    8: ('成', "月支的三合日，吉神的日子。 宜：结婚、开市、修造、动土、安床、破土、安葬、搬迁、交易、求财、出行、立契、竖柱、裁种、牧养。 忌：诉讼。"),
    9: ('收', "收成、收获的日子。 宜：祈福、求嗣、赴任、嫁娶、安床、修造、动土、求学、开市、交易、买卖、立契。 忌：破土、安葬。"),
    10: ('开', "重新开展的好日子。 宜：祭祀、祈福、开光、入宅、嫁娶、上任、修造、动土、开市、安床、交易、出行、竖柱。 忌：诉讼、安葬。"),
    11: ('闭', "闭藏的日子 宜：安门、伐木、修造、动土。 忌：出行、嫁娶。"), 
}


nayins = {
    ('甲', '子'): '海中金', ('乙', '丑'): '海中金', ('壬', '寅'): '金泊金', ('癸', '卯'): '金泊金',
    ('庚', '辰'): '白蜡金', ('辛', '巳'): '白蜡金', ('甲', '午'): '砂中金', ('乙', '未'): '砂中金',
    ('壬', '申'): '剑锋金', ('癸', '酉'): '剑锋金', ('庚', '戌'): '钗钏金', ('辛', '亥'): '钗钏金',
    ('戊', '子'): '霹雳火', ('己', '丑'): '霹雳火', ('丙', '寅'): '炉中火', ('丁', '卯'): '炉中火',
    ('甲', '辰'): '覆灯火', ('乙', '巳'): '覆灯火', ('戊', '午'): '天上火', ('己', '未'): '天上火',
    ('丙', '申'): '山下火', ('丁', '酉'): '山下火', ('甲', '戌'): '山头火', ('乙', '亥'): '山头火',
    ('壬', '子'): '桑柘木', ('癸', '丑'): '桑柘木', ('庚', '寅'): '松柏木', ('辛', '卯'): '松柏木',
    ('戊', '辰'): '大林木', ('己', '巳'): '大林木', ('壬', '午'): '杨柳木', ('癸', '未'): '杨柳木',
    ('庚', '申'): '石榴木', ('辛', '酉'): '石榴木', ('戊', '戌'): '平地木', ('己', '亥'): '平地木',
    ('庚', '子'): '壁上土', ('辛', '丑'): '壁上土', ('戊', '寅'): '城头土', ('己', '卯'): '城头土',
    ('丙', '辰'): '砂中土', ('丁', '巳'): '砂中土', ('庚', '午'): '路旁土', ('辛', '未'): '路旁土',
    ('戊', '申'): '大驿土', ('己', '酉'): '大驿土', ('丙', '戌'): '屋上土', ('丁', '亥'): '屋上土',
    ('丙', '子'): '涧下水', ('丁', '丑'): '涧下水', ('甲', '寅'): '大溪水', ('乙', '卯'): '大溪水',
    ('壬', '辰'): '长流水', ('癸', '巳'): '长流水', ('丙', '午'): '天河水', ('丁', '未'): '天河水',
    ('甲', '申'): '井泉水', ('乙', '酉'): '井泉水', ('壬', '戌'): '大海水', ('癸', '亥'): '大海水',    
}

empties = {
    ('甲', '子'): ('戌','亥'), ('乙', '丑'):('戌','亥'), 
    ('丙', '寅'): ('戌','亥'), ('丁', '卯'): ('戌','亥'), 
    ('戊', '辰'): ('戌','亥'), ('己', '巳'): ('戌','亥'),
    ('庚', '午'): ('戌','亥'), ('辛', '未'): ('戌','亥'),
    ('壬', '申'): ('戌','亥'), ('癸', '酉'): ('戌','亥'),

    ('甲', '戌'): ('申','酉'), ('乙', '亥'): ('申','酉'),
    ('丙', '子'): ('申','酉'), ('丁', '丑'): ('申','酉'),
    ('戊', '寅'): ('申','酉'), ('己', '卯'): ('申','酉'),
    ('庚', '辰'):('申','酉'), ('辛', '巳'): ('申','酉'),
    ('壬', '午'): ('申','酉'), ('癸', '未'): ('申','酉'),

    ('甲', '申'): ('午','未'), ('乙', '酉'): ('午','未'),
    ('丙', '戌'): ('午','未'), ('丁', '亥'): ('午','未'),
    ('戊', '子'): ('午','未'), ('己', '丑'): ('午','未'), 
    ('庚', '寅'): ('午','未'), ('辛', '卯'): ('午','未'),
    ('壬', '辰'): ('午','未'), ('癸', '巳'): ('午','未'),

    ('甲', '午'): ('辰','己'), ('乙', '未'): ('辰','己'),
    ('丙', '申'): ('辰','己'), ('丁', '酉'): ('辰','己'),
    ('戊', '戌'): ('辰','己'), ('己', '亥'): ('辰','己'),
    ('庚', '子'): ('辰','己'), ('辛', '丑'): ('辰','己'),
    ('壬', '寅'): ('辰','己'), ('癸', '卯'): ('辰','己'),

    ('甲', '辰'): ('寅','卯'), ('乙', '巳'): ('寅','卯'),
    ('丙', '午'): ('寅','卯'), ('丁', '未'): ('寅','卯'),
    ('戊', '申'): ('寅','卯'), ('己', '酉'): ('寅','卯'),
    ('庚', '戌'): ('寅','卯'), ('辛', '亥'): ('寅','卯'),
    ('壬', '子'): ('寅','卯'), ('癸', '丑'): ('寅','卯'), 


    ('甲', '寅'): ('子','丑'), ('乙', '卯'): ('子','丑'),     
    ('丙', '辰'): ('子','丑'), ('丁', '巳'): ('子','丑'), 
    ('戊', '午'): ('子','丑'), ('己', '未'): ('子','丑'),
    ('庚', '申'): ('子','丑'), ('辛', '酉'): ('子','丑'), 
    ('壬', '戌'): ('子','丑'), ('癸', '亥'): ('子','丑'),    
}


emptie4s = {
    ('甲', '子'): '水', ('乙', '丑'):'水', 
    ('丙', '寅'): '水', ('丁', '卯'): '水', 
    ('戊', '辰'):  '水', ('己', '巳'):  '水',
    ('庚', '午'):  '水', ('辛', '未'):  '水',
    ('壬', '申'):  '水', ('癸', '酉'):  '水',

    ('甲', '申'):  '金', ('乙', '酉'):  '金',
    ('丙', '戌'):  '金', ('丁', '亥'):  '金',
    ('戊', '子'):  '金', ('己', '丑'):  '金', 
    ('庚', '寅'):  '金', ('辛', '卯'):  '金',
    ('壬', '辰'):  '金', ('癸', '巳'):  '金',

    ('甲', '午'):  '水', ('乙', '未'):  '水',
    ('丙', '申'):  '水', ('丁', '酉'):  '水',
    ('戊', '戌'):  '水', ('己', '亥'):  '水',
    ('庚', '子'):  '水', ('辛', '丑'):  '水',
    ('壬', '寅'):  '水', ('癸', '卯'):  '水',


    ('甲', '寅'):  '金', ('乙', '卯'):  '金',     
    ('丙', '辰'):  '金', ('丁', '巳'):  '金', 
    ('戊', '午'):  '金', ('己', '未'):  '金',
    ('庚', '申'):  '金', ('辛', '酉'):  '金', 
    ('壬', '戌'):  '金', ('癸', '亥'):  '金',    
}

minggongs = {
    "子": "天贵星、志气不凡、富裕清吉。",
    "丑": "天厄星、先难后吉、离祖劳心、晚年吉。",
    "寅": "天权星、聪明大器、中年有权柄。",
    "卯": "天赦星、慷慨疏财、得权时须谦逊。",
    "辰": "天如星、事多翻覆、机谋多能。",
    "巳": "天文星、文章振发、女命有好夫。",
    "午": "天福星、荣华吉命。",
    "未": "天驿星、一生劳碌、离祖始安。",
    "申": "天孤星、不宜早婚、女命妨夫。",
    "酉": "天秘星、性情刚直、时有是非。",
    "戌": "天艺星、心性平和、艺道有名。",
    "亥": "天寿星、心慈明悟、克己助人。",

}

rizhus = {
	"甲子": "虽坐沐浴，若四往有禄，看印，冬生不作妻败", 
	"乙丑": "身坐财官，有乙庚合最吉", 
	"丙寅": "金绝水死，财官俱背，但丙火长生食神独旺，主有寿，己亥、辛卯、癸巳时贵", 
	"丁卯": "财官俱背，须合气、禄、火扶", 
	"戊辰": "壬庚入墓，乙木自坐财官", 
	"己巳": "水绝木病，丙寅时贵", 
	"庚午": "庚金坐死但午上自坐官、印，虽败不困", 
	"辛未": "身旺，丙申时贵", 
	"壬申": "水辰生位，聪明秀丽", 
	"癸酉": "财官无气，要用旺者吉", 
	"甲戌": "身坐旺官，临火库，心怀慈善，丙寅时贵", 
	"乙亥": "日坐木局，丙壬、壬午、甲申时贵", 
	"丙子": "身坐财啊．癸巳时", 
	"丁丑": "金库荣丰，见辛亥时贵", 
	"戊寅": "甲木当局，官杀者吉", 
	"己卯": "身坐杀地，须身杀力停者吉",
	"庚辰": "魁罡，忌于刑冲", 
	"辛巳": "金局坐死不妨，戊子时贵", 
	"壬午": "财官双美，伶俐有谋，壬寅时贵", 
	"癸未": "身坐杀位须身力二停", 
	"甲申": "坐绝，四柱俱绝者吉", 
	"乙酉": "坐杀四乙酉或有化杀则吉，辛巳时，为化气金局贵", 
	"丙戌": "夏生则财官无气", 
	"丁亥": "日贵，壬寅时，乙巳时皆贵", 
	"戊子": "自坐财，乙卯时，丁巳时贵", 
	"己丑": "有财无官，丙寅时贵", 
	"庚寅": "坐绝反主吉昌", 
	"辛卯": "财衰无妨，见戊子时贵", 
	"壬辰": "魁罡、不喜冲刑，遇建禄反卑", 
	"癸巳": "财官双美最吉祥，丁已时贵", 
	"甲午": "夏生大吉", 
	"乙未": "逢财伤官格", 
	"丙申": "身坐财，庚寅时贵，癸巳时亦吉", 
	"丁酉": "临财学精，壬寅时贵", 
	"戊戌": "魁罡，忌冲刑", 
	"己亥": "自坐财官得高名，丙寅时贵", 
	"庚子": "有丁火则吉", 
	"辛丑": "食神荣昌，主寿", 
	"壬寅": "水火既济，见壬寅时大吉", 
	"癸卯": "日贵，衰神旺吉", 
	"甲辰": "身坐财库水气，性善良，丙寅时吉", 
	"乙巳": "男女妨家室，有壬者轻", 
	"丙午": "日刃喜刑冲，男、女妨家室，见乙、癸者轻", 
	"丁未": "坐印小吉", 
	"戊申": "甲绝有财无官", 
	"己酉": "财禄一背，皆须生扶", 
	"庚戌": "魁罡，忌火旺地支之运及冲刑", 
	"辛亥": "财生，官绝", 
	"壬子": "日刃喜刑冲", 
	"癸丑": "喜冲不作灾论", 
	"甲寅": "财官二背，见辛未时贵", 
	"乙卯": "财官无气，见庚辰时贵", 
	"丙辰": "冬生不吉，庚寅时贵", 
	"丁巳": "男、女妨家室．有戊者重，甲、寅者轻", 
	"戊午": "日刃喜刑冲，四、五月在刑地亦吉", 
	"己未": "丙寅时贵（无水大吉）", 
	"庚申": "日德、日禄、寿", 
	"辛酉": "日禄、戊子、丙申时贵", 
	"壬戌": "元武当权．等作财官双美", 
	"癸亥": "得癸亥时夫贵", 
}

#ges = {
     #('庚', '子'):'飞天禄马', ('壬', '子'):'飞天禄马',
     #('辛', '亥'):'飞天禄马', ('癸', '亥'):'飞天禄马',     
#}

#ge_descs = {
    #'飞天禄马':'''
    #若逢伤官月建,如凶处,未必为凶,内有倒禄飞冲,忌官星,亦嫌羁绊。
    #柱无财官,方用。又须月时或年与日同支,方能并冲。
    #'''
#}

up_down_hes = (('戊','子'),('辛','巳'), ('壬','午'), ('丁','亥'))

lu_types = {
    "甲":{('丙','寅'):'福星禄 名位禄 吉', ('戊','寅'):'伏马禄 吉', 
           ('庚','寅'):'破禄，半吉半凶', ('壬','寅'):'正禄，带截路空亡，必为僧道 不吉',
           ('甲','寅'):'长生禄，大吉', ('乙','卯'):'生成禄，大吉',},
    "乙":{('乙','卯'):'喜神旺禄 吉', ('丁','卯'):'截路空亡 凶', 
           ('己','卯'):'进神禄 吉', ('辛','卯'):'破禄，又为交神，半吉半凶',
           ('癸','卯'):'死禄 虽贵终贫 凶',},
    "丙":{('己','巳'):'九天库禄 吉', ('辛','巳'):'截路空亡 凶', 
           ('乙','巳'):'旺马禄 吉', ('丁','巳'):'库禄 吉',
           ('癸','巳'):'伏贵神禄，半吉半凶',}, 
    "丁":{('庚','午'):'截路空亡 凶', ('壬','午'):'德合禄 吉', 
           ('甲','午'):'进神禄 吉', ('丙','午'):'喜神禄，交羊刃，半吉',
           ('戊','午'):'伏羊刃 禄，多凶',},   
    "戊":{('己','巳'):'九天库禄，吉', ('辛', '巳'):'截路空亡 凶', 
           ('癸','巳'):'贵神禄，戊癸化合，有官位重 吉', ('乙','巳'):'驿马同乡禄 吉',
           ('戊','巳'):'旺库禄 吉',},    
    "己":{('庚','午'):'截路空亡 凶', ('壬','午'):'死鬼禄 凶', 
           ('甲','午'):'进神合禄 显达之象 吉', ('丙','午'):'喜神禄 半吉',
           ('戊','午'):'伏神羊刃禄，凶',},  
    "庚":{('壬','申'):'大败禄 凶', ('甲', '申'):'截路空亡禄 凶', 
           ('丙','申'):'大败禄，多成败 半吉', ('戊','申'):'伏马禄，多滞，若值福星，贵吉',
           ('庚','申'):'长生禄，大吉',},      
    "辛":{('癸','酉'):'伏神禄，水火相犯，凶', ('乙','酉'):'破禄 成败 凶', 
           ('丁','酉'):'空亡贵神禄 丁木受气，辛水沐浴，主奸淫事；值喜神，吉。', 
           ('己','酉'):'进神禄 吉', ('辛','酉'):'正禄 吉',},    
    "壬":{('丁','亥'):'贵神合禄 吉', ('乙', '亥'):'天德禄 吉', 
           ('己','亥'):'旺禄 大吉', ('辛','亥'):'同马乡禄 大吉',
           ('癸','亥'):'大败禄，贫薄 凶',},     
    "癸":{('甲','子'):'进神禄，主登科进达 吉', ('丙','子'):'交羊刃禄，带福星，贵有权。 吉', 
           ('戊','子'):'伏羊刃合贵禄 半吉', 
           ('庚','印禄'):'进神禄 吉', ('壬','子'):'正羊刃禄，凶',},        
}


wenxing = {"甲":'午', "乙":"巳", "丙":"申", "丁":"酉", "戊":"申", "己":"酉", 
           "庚": "戌", "辛":"亥", "壬": "寅", "癸":"卯"}
tianyin =  {"甲":'寅',  "乙":"亥", "丙":"戌", "丁":"酉", "戊":"申", "己":"未", 
            "庚": "午", "辛":"巳", "壬": "辰", "癸":"卯"}
xuetangs = {'金':("辛","巳"), '木':("己","亥"), '水':("甲","申"), 
            '火':("丙", "寅"), '土':("戊","申")}

# 天乙贵人，有两种分法
tianyis =  {"甲":'未',  "乙":"申", "丙":"酉", "丁":"亥", "戊":'丑', "己":"子", 
            "庚": "丑", "辛":"寅", "壬": "卯", "癸":"巳"}

# 玉堂贵人，有两种分法
yutangs =  {"甲":'丑',  "乙":"子", "丙":"亥", "丁":"酉", "戊":'未', "己":"申", 
            "庚": "未", "辛":"午", "壬": "巳", "癸":"卯"}

wangs = {"子":"亥", "丑":"申", "寅":"巳", "卯":"寅", "辰":"亥", "巳":"申", 
            "午":"巳", "未":"寅", "申":"亥", "酉":"申", "戌":"巳", "亥":"寅"}
jieshas = {"子":"巳", "丑":"寅", "寅":"亥", "卯":"申", "辰":"巳", "巳":"寅", 
         "午":"亥", "未":"申", "申":"巳", "酉":"寅", "戌":"亥", "亥":"申"}
            
ma_zhus =  {
    ("甲","申"):'截路空日马', ("丙","申"):'截路空日马', ("戊","申"):'福星伏马', 
    ("庚","申"):'逢天关马', ("壬","申"):'大败马', 
    ("甲","寅"):'正禄文星马', ("丙","寅"):'福星马', ("戊","寅"):'伏马', 
    ("庚","寅"):'破禄马', ("壬","寅"):'截路马',   
    ("乙","亥"):'天德马', ("丁","亥"):'天乙马', ("己","亥"):'旺禄马', 
    ("辛","亥"):'正禄马', ("癸","亥"):'大败马',     
    ("乙","巳"):'正禄马', ("丁","巳"):'旺气马', ("己","巳"):'九天禄库马', 
    ("辛","巳"):'截路马', ("癸","巳"):'天乙伏马',      
}   



jianlu_desc = '''

================  建禄格 ================  比例 1/12
喜: 财、官和印绶  忌: 忌伤官和劫财；  杀不可太旺。
颇宜时带偏官、偏财或食神，更看年时上露者取用，若略见财官，反争夺不吉。
难招祖业，必主平生见财不聚，却病少寿长，行运再见比，克妻妨父损子，或官非破财，或因妻孥财帛争夺。
有财官，引旺得地，官星有助，运临官星有气之地，亦贵；财星有助，运临财旺之地，亦富；财官俱旺，乃富贵之命。
若时逢财库，运至财乡，必主晚年大富。年上财官有助，必享祖荫。
若四柱元无财官，纵运行财官之地，亦止虚花而已。命无财官，岁运又行比，一生贫蹇。
'''

jianlus = {
    ('甲', '寅'):'柱中乙卯未字多，主无祖财，[劫财]克妻，一世孤贫，作事虚诈，为人大模样',
    ('乙', '卯'):'''
    柱有庚辛巳酉丑申及戊己巳午辰戌等字，财官多则贵，壬癸申子辰亥水印成局亦佳，更运逢之尤妙''',   
    ('丙', '巳'):'岁时干支水金成局，运历财官旺地，亦主富贵。',    
    ('丁', '午'):'''
    金败水绝，财[庚-沐浴]官[壬-胎]俱背，顺运克妻，逆运克三妻，若柱有巳酉丑庚辛壬癸亥申子辰，
    运临财官旺地亦发，用煞或印，以多为贵，若止建禄，亦同前断。''',
    ('戊', '巳'):
    '''年日时无水，主克妻[癸-胎]，无祖业，子[病]多不肖，柱中多有官则吉，如见偏官，主尊贵，
    岁月若是火多及或印绶，虽无财官，主吉，若柱内隐显壬癸亥申子辰水局，晚子一二，
    有甲寅乙卯亥未木局，运至财官旺地亦发。''',   
    ('己', '午'):'''
    以壬水为财，五月水囚[壬-胎]，主无祖业，克妻，子[乙-长生]亦不多，
    岁时透出寅甲为正官，五月甲死，官必卑小，喜见亥卯未乙，身旺见官煞为妙，偏财亦美。''',
    ('庚', '申'):'''
    上旬生，近木余气，略无祖财，虽节气临水绝之乡，尚有三四分库财为福，运至丙戌，财尽矣，
    若年日时多带财，好命看，见丙丁巳午寅戌火局则有官，以煞化官也，官小亦不清显，怕壬癸亥子，克官不成。''',

    ('戊', '巳'):
    '''年日时无水，主克妻[癸-胎]，无祖业，子[病]多不肖，柱中多有官则吉，如见偏官，主尊贵，
    岁月若是火多及或印绶，虽无财官，主吉，若柱内隐显壬癸亥申子辰水局，晚子一二，
    有甲寅乙卯亥未木局，运至财官旺地亦发。''',   
    ('己', '午'):'''
    以壬水为财，五月水囚[壬-胎]，主无祖业，克妻，子[乙-长生]亦不多，
    岁时透出寅甲为正官，五月甲死，官必卑小，喜见亥卯未乙，身旺见官煞为妙，偏财亦美。''',
    ('庚', '申'):'''
    上旬生，近木余气，略无祖财，虽节气临水绝之乡，尚有三四分库财为福，运至丙戌，财尽矣，
    若年日时多带财，好命看，见丙丁巳午寅戌火局则有官，以煞化官也，官小亦不清显，怕壬癸亥子，克官不成。''',

    ('辛', '酉'):'''
    无祖财，柱中多见分夺，孤贫[甲-胎]无妻，或克妻无财，若带木火生旺，又当富贵，原无财官，
    又行生地，其劫祸尤重，或见辛酉则为专禄，更有财官印食之神岁运再逢尤好，逆运南方则吉，
    顺运北方，百事无成，若辛卯、辛未日身自坐财，可许衣禄，辛巳日有贵，官禄亦轻。''',
                                                                                                                               
    ('壬', '亥'):'''
    无祖业，柱中多见火土，主自成立有官，如见水多泛滥，无成、克妻、贫薄。''',
                                                                                                                               
    ('癸', '子'):'''
    无祖业，柱中多见火土，主自成立有官，如见水多泛滥，无成、克妻、贫薄。''',
}

shang_guans = {
    '火': '伤尽。','金': '要见官', '木': '官要旺','土':'伤尽。', '水': '伤官木也要土'}

tianyuans = {
    '火': '主兵权，为将镇三边。',
    '金': '有重权，防御刺史臣', 
    '木': '伤衰化煞，为权势若雷',
    '土':'正禄八座三台福。', 
    '水': '入官局，可沾侍郎禄'}

lu_ku_cai = {"甲":'丑', "乙":"丑", "丙":"午", "丁":"午", "戊":"辰", "己":"辰", 
            "庚": "未", "辛":"未", "壬": "戌", "癸":"戌"}
self_zuo = {
    '官':'''''',        
    '杀':'''天元坐杀：喜旺，忌明现食伤。无官煞复克，喜印化煞，财旺身旺。为人心多性急，阴险怀毒，僭伪谋害，不近人情.
    如无助化，再行煞旺运，或再见煞克，为人必面目瘢痕，侏儒跛鳖，骈指瘤赘，奸贪猛暴，恃强不惮，累犯宪章。克重多夭，合格为武贵。''',                 
    '财':'''''',
    '才':'''''',    
    '印':'''''',
    '枭':'''''',      
    '食':'''''',
    '伤':'''''',     
    '比':'''''',
    '劫':'''''',       
}


year_shens = {
    '孤辰':{"子":"寅", "丑":"寅", "寅":"巳", "卯":"巳", "辰":"巳", "巳":"申", 
              "午":"申", "未":"申", "申":"亥", "酉":"亥", "戌":"亥", "亥":"寅"},
    '寡宿':{"子":"戌", "丑":"戌", "寅":"丑", "卯":"丑", "辰":"丑", "巳":"辰", 
              "午":"辰", "未":"辰", "申":"未", "酉":"未", "戌":"未", "亥":"戌"},   
    '大耗':{"子":"巳未", "丑":"午申", "寅":"未酉", "卯":"申戌", "辰":"酉亥", "巳":"戌子", 
              "午":"亥丑", "未":"子寅", "申":"丑卯", "酉":"寅辰", "戌":"卯巳", "亥":"辰午"},      
}

month_shens = {
    '天德':{"子":"巳", "丑":"庚", "寅":"丁", "卯":"申", "辰":"壬", "巳":"辛", 
            "午":"亥", "未":"甲", "申":"癸", "酉":"寅", "戌":"丙", "亥":"乙"},
    '月德':{"子":"壬", "丑":"庚", "寅":"丙", "卯":"甲", "辰":"壬", "巳":"庚", 
              "午":"丙", "未":"甲", "申":"壬", "酉":"庚", "戌":"丙", "亥":"甲"},
}
    

day_shens = { 
    '将星':{"子":"子", "丑":"酉", "寅":"午", "卯":"卯", "辰":"子", "巳":"酉", 
              "午":"午", "未":"卯", "申":"子", "酉":"酉", "戌":"午", "亥":"卯"},      
    '华盖':{"子":"辰", "丑":"丑", "寅":"戌", "卯":"未", "辰":"辰", "巳":"丑", 
              "午":"戌", "未":"未", "申":"辰", "酉":"丑", "戌":"戌", "亥":"未"}, 
    '驿马': {"子":"寅", "丑":"亥", "寅":"申", "卯":"巳", "辰":"寅", "巳":"亥", 
            "午":"申", "未":"巳", "申":"寅", "酉":"亥", "戌":"申", "亥":"巳"},
    '劫煞': {"子":"巳", "丑":"寅", "寅":"亥", "卯":"申", "辰":"巳", "巳":"寅", 
         "午":"亥", "未":"申", "申":"巳", "酉":"寅", "戌":"亥", "亥":"申"},
    '亡神': {"子":"亥", "丑":"申", "寅":"巳", "卯":"寅", "辰":"亥", "巳":"申", 
            "午":"巳", "未":"寅", "申":"亥", "酉":"申", "戌":"巳", "亥":"寅"},    
    '桃花': {"子":"酉", "丑":"午", "寅":"卯", "卯":"子", "辰":"酉", "巳":"午", 
            "午":"卯", "未":"子", "申":"酉", "酉":"午", "戌":"卯", "亥":"子"},        
}

g_shens = {
    '天乙':{"甲":'未丑',  "乙":"申子", "丙":"酉亥", "丁":"酉亥", "戊":'未丑', "己":"申子", 
            "庚": "未丑", "辛":"寅午", "壬": "卯巳", "癸":"卯巳"},
    '文昌':{"甲":'巳', "乙":"午", "丙":"申", "丁":"酉", "戊":"申", "己":"酉", 
            "庚": "亥", "辛":"子", "壬": "寅", "癸":"丑"},   
    '阳刃':{"甲":'卯', "乙":"", "丙":"午", "丁":"", "戊":"午", "己":"", 
            "庚": "酉", "辛":"", "壬": "子", "癸":""},     
    '红艳':{"甲":'午', "乙":"午", "丙":"寅", "丁":"未", "戊":"辰", "己":"辰", 
            "庚": "戌", "辛":"酉", "壬": "子", "癸":"申"},       
}

shens_infos = {
    '孤辰': "孤僻、孤独：月支容易不合群、容易30岁以后才结婚。女命官杀月干坐顾辰、独居概率大，时支则有阴道之心。",
    '寡宿': "类似孤辰，同柱有天月德没关系。男怕孤，女怕寡。",  
    '大耗': "意外破损，单独没关系。与桃花或驿马之类同柱则危险。",
    '天德': "先天有福，日干终生有福。忌讳冲克，不怕合。女命与夫星同干更佳。",
    '月德': "先天有福，日干终生有福。忌讳冲克，不怕合。女命与夫星同干更佳。",
    '将星': "有理想、气度、即从容不迫。",     
    '华盖': "有艺术、水准与命格相关。",
    '驿马': "多迁移、水准与命格相关。女驿马合贵人，终沦落风尘。",
    '劫煞': "与贵人同柱没关系、与亡神对冲。会三刑不佳，其他情况还好。为日主所克无大碍。",
    '亡神': "与贵人同柱没关系、与劫煞对冲。会三刑不佳，其他情况还好。为日主所克无大碍。",  
    '桃花': "凶居多、女正官坐桃花吉。", 
    '天乙': "后天解难、女命不适合多",
    '文昌': "诗书佳，未必有福，女命多参考李清照。",   
    '阳刃': "性格刚强，女命未必佳。",     
    '红艳': "爱得执著，不顾及地位差异。",  
}

tiaohous = {
    '甲寅': '1丙2_癸', '甲卯': '1庚2戊丙3己丁', '甲辰': '1庚2壬丁', '甲巳': '1癸2庚丁', '甲午': '1癸2庚丁','甲未': '1癸2庚丁', 
    '甲申': '1庚2壬丁', '甲酉': '1庚2丙丁', '甲戌': '1庚2壬甲3癸丁', '甲亥': '1庚2戊丁3_丙', '甲子': '1丁2丙庚', '甲丑': '1丁2丙庚',
    '乙寅': '1丙2_癸', '乙卯': '1丙2_癸', '乙辰': '1癸2戊丙', '乙巳': '1癸', '乙午': '1癸2_丙','乙未': '1癸2_丙', 
    '乙申': '1庚2己癸', '乙酉': '1癸2丁丙', '乙戌': '1癸2_辛', '乙亥': '1丙2_戊', '乙子': '1丙', '乙丑': '1丙',
    '丙寅': '1壬2_庚', '丙卯': '1壬2_己', '丙辰': '1壬2_甲', '丙巳': '1壬2癸庚', '丙午': '1壬2_庚','丙未': '1壬2_庚', 
    '丙申': '1壬2_戊', '丙酉': '1壬2_癸', '丙戌': '1甲2_壬', '丙亥': '1甲2庚戊3壬', '丙子': '1壬2己戊', '丙丑': '1壬2_甲',
    '丁寅': '1甲2_庚', '丁卯': '1庚2_甲', '丁辰': '1甲2_庚', '丁巳': '1甲2_庚', '丁午': '1壬2癸庚','丁未': '1甲2庚壬', 
    '丁申': '1甲2丙庚3戊', '丁酉': '1甲2丙庚3戊', '丁戌': '1甲2戊庚', '丁亥': '1甲2_庚', '丁子': '1丙', '丁丑': '1甲2_庚',
    '戊寅': '1丙2癸甲', '戊卯': '1丙2癸甲', '戊辰': '1甲2癸丙', '戊巳': '1甲2癸丙', '戊午': '1壬2丙甲','戊未': '1癸2甲丙', 
    '戊申': '1丙2甲癸', '戊酉': '1丙2_癸', '戊戌': '1甲2癸丙', '戊亥': '1甲2_丙', '戊子': '1丙2_甲', '戊丑': '1丙2_甲',    
    '己寅': '1丙2甲庚', '己卯': '1甲2癸丙', '己辰': '1丙2甲癸', '己巳': '1癸2_丙', '己午': '1癸2_丙','己未': '1癸2_丙', 
    '己申': '1丙2_癸', '己酉': '1丙2_癸', '己戌': '1甲2癸丙', '己亥': '1丙2戊甲', '己子': '1丙2戊甲', '己丑': '1丙2戊甲',  
    '庚寅': '1戊2丙甲3丁壬', '庚卯': '1丁2丙甲3_庚', '庚辰': '1甲2壬丁3癸', '庚巳': '1壬2丙戊3丁', '庚午': '1壬2_癸','庚未': '1丁2_甲', 
    '庚申': '1丁2_甲', '庚酉': '1丁2丙甲', '庚戌': '1甲2_壬', '庚亥': '1丁2_丙', '庚子': '1丁2丙甲', '庚丑': '1丙2甲丁',      
    '辛寅': '1己2庚壬', '辛卯': '1壬2_甲', '辛辰': '1壬2_甲', '辛巳': '1壬2癸甲', '辛午': '1壬2癸巳','辛未': '1壬2甲庚', 
    '辛申': '1壬2戊甲', '辛酉': '1壬2_申', '辛戌': '1壬2_甲', '辛亥': '1壬2_丙', '辛子': '1丙2壬戊3甲', '辛丑': '1丙2戊壬3己', 
    '壬寅': '1庚2戊丙', '壬卯': '1戊2庚辛', '壬辰': '1甲2_庚', '壬巳': '1壬2庚辛3癸', '壬午': '1癸2辛庚','壬未': '1辛2_甲', 
    '壬申': '1戊2_丁', '壬酉': '1甲2_庚', '壬戌': '1甲2_丙', '壬亥': '1戊2庚丙', '壬子': '1戊2_丙', '壬丑': '1丙2甲丁',  
    '癸寅': '1辛2_丙', '癸卯': '1庚2_辛', '癸辰': '1丙2甲辛', '癸巳': '1辛', '癸午': '1庚2癸壬','癸未': '1庚2壬辛3癸', 
    '癸申': '1丁', '癸酉': '1辛2_丙', '癸戌': '1辛2壬甲3癸', '癸亥': '1庚2戊辛3丁', '癸子': '1丙3_辛', '癸丑': '1丙2夜生贵丁',      
    
}

jins = {
    
    '甲': '辰戌丑未入墓库运；巳未申酉亥月有夭折运；申酉戌亥月调候待改进！', 
    '乙': '辰未亥有夭寿运；寅辰午申酉调候待改进！', 
    '丙': '子酉亥有夭折运；午未亥调候待改进！',
    '丁': '子辰午亥有夭折运；寅巳午酉戌调候待改进！',
    '戊': '卯亥有夭折运；未辰戌调候待改进！',
    '己': '子寅卯酉亥有夭损运；寅卯辰巳亥子丑调候待改进！', 
    '庚': '子卯辰巳午戌有损寿运；寅卯辰巳午申调候待改进！',   
    '辛': '丑寅有夭折运；寅卯巳午酉戌亥调候待改进！',
    '壬': '巳未申有损寿运；寅卯巳午亥调候待改进！', 
    '癸': '丑寅午戌亥有损寿运；子丑辰巳午未亥调候待改进！', 
}

jinbuhuan = {
    # 2级次P64 余氏P59
    '甲子': '调候：喜丁 忌壬癸  大运：喜逆行水木 忌午未  备注：喜官杀', 
    '甲丑': '调候：喜丁 忌壬辛癸  大运：喜寅卯申酉 忌午未',
    '甲寅': '调候：喜丙癸 忌戊己  大运：喜逆行金水 忌午未  备注：财、杀', 
    '甲卯': '调候：喜庚  忌壬癸  大运：不拘顺逆 忌申酉',
    '甲辰': '调候：喜庚  忌丁癸  大运：喜申酉 忌寅卯巳午 备注：正官根深',    
    '甲巳': '调候：喜癸 忌戊己  大运：喜寅卯  忌午未(夭) 备注：根深财官',
    '甲午': '调候：喜癸 忌戊己  大运：喜亥子寅卯  忌申酉 ', 
    '甲未': '调候：喜癸 忌戊乙己  大运：喜亥子寅  忌申酉(夭) 备注：根深财官',
    '甲申': '调候：喜丙 忌壬癸  大运：喜亥子寅  忌午巳(夭) 备注：忌无根杀旺',
    '甲酉': '调候：喜甲壬 忌丁  大运：喜亥子  忌午(夭) 备注：正官',
    '甲戌': '调候：喜辛壬 忌丁  大运：喜顺亥未  忌辰 备注：财官',    
    '甲亥': '调候：喜丁 忌壬癸  大运：喜顺寅卯  忌午未(夭) 备注：七杀',  
    
    
    '乙子': '调候：喜丙 忌壬  大运：喜戌申酉 忌亥丑  备注：忌官杀成局', 
    '乙丑': '调候：喜丙 忌辛壬  大运：喜巳午未寅卯 ',
    '乙寅': '调候：喜丙 忌壬  大运：喜巳午申酉 忌丑亥子  备注：财官', 
    '乙卯': '调候：喜丙癸  忌壬己  大运：喜巳午申酉 忌卯子亥',
    '乙辰': '调候：喜丙  忌癸  大运：喜申酉 忌戌(夭) ',    
    '乙巳': '调候：喜癸 忌戊己  大运：喜亥子卯寅  忌申酉(寿损) 备注：忌无根',
    '乙午': '调候：喜癸 忌戊己  大运：喜辰卯寅  忌申酉(灾疾)  备注：忌身轻', 
    '乙未': '调候：喜癸丙 忌乙壬己  大运：喜巳午寅卯  忌申酉子(夭) 备注：官杀',
    '乙申': '调候：喜丙癸 忌壬  大运：喜未午巳  忌戊亥子 备注：忌身柔',
    '乙酉': '调候：喜癸丁 忌己壬  大运：喜未午巳  忌日主无根 备注：忌无根',
    '乙戌': '调候：喜癸辛 忌丁  大运：  忌酉亥(灾疾) ',    
    '乙亥': '调候：喜丙戊 忌壬甲  大运：喜逆申酉  忌辰(夭) 备注：喜官杀', 
    
    '丙子': '调候：喜壬 忌己  大运：喜寅卯巳午 忌亥申酉(夭)  备注：印重', 
    '丙丑': '调候：喜壬甲 忌辛己  大运：喜申酉戌 忌寅卯巳午(灾)  备注：喜印忌根浅 ',
    '丙寅': '调候：喜壬庚 忌己  大运：喜申酉戌 忌卯 ', 
    '丙卯': '调候：喜壬己  忌甲  大运：喜巳午未 忌寅辰 备注：忌无官',
    '丙辰': '调候：喜壬  忌癸  大运：喜戌丑 忌巳午亥子 备注：喜戊己',    
    '丙巳': '调候：喜壬庚 忌丁  大运：喜申酉寅卯  忌戌(灾) 备注：喜官杀',
    '丙午': '调候：喜壬 忌己丁  大运：喜申酉亥丑  忌寅卯  备注：喜杀', 
    '丙未': '调候：喜癸庚 忌乙  大运：喜申酉亥子  忌寅卯 备注：忌杀喜官',
    '丙申': '调候：喜丙 忌壬癸  大运：喜寅卯巳午  忌亥子 备注：喜从化',
    '丙酉': '调候：喜壬癸 忌戊己  大运：喜亥子  忌寅卯(夭) 备注：忌比劫',
    '丙戌': '调候：喜甲壬 忌丁己  大运：喜寅卯  忌亥子辰 备注：喜杀忌官',    
    '丙亥': '调候：喜甲壬 忌己  大运：喜寅卯巳午  忌申酉(夭)',  
    
    '丁子': '调候：喜甲庚 忌己丙  大运：喜寅卯辰 忌申酉戌(夭)  备注：七杀', 
    '丁丑': '调候：喜甲庚 忌辛己丙  大运：喜寅卯辰 忌巳午未  备注：大忌土多 ',
    '丁寅': '调候：喜壬庚 忌己丁  大运：喜巳午未亥子 忌申酉(灾祸) 备注：喜水忌土多 ', 
    '丁卯': '调候：喜庚甲  忌丙  大运：喜巳午亥子 忌寅卯申酉 备注：无官独杀',
    '丁辰': '调候：喜甲庚 忌癸丙  大运：喜巳午未 巳戌亥(夭) ',    
    '丁巳': '调候：喜庚甲  忌丙  大运：喜庚甲  忌丙',
    '丁午': '调候：喜壬癸庚 忌丁  大运：喜亥子  忌戌未  备注：忌无水(夭)', 
    '丁未': '调候：喜甲壬庚 忌乙丁  大运：喜申酉  忌巳午 备注：喜金财',
    '丁申': '调候：喜甲庚丙 忌壬  大运：喜巳午未  忌亥子 备注：身强根深',
    '丁酉': '调候：喜辛甲丙 忌丁  大运：喜申未午巳  忌戌丑 备注：喜官杀',
    '丁戌': '调候：喜甲庚 忌丁  大运：喜寅卯巳午  忌亥子(夭) ',    
    '丁亥': '调候：喜甲庚 忌丙  大运：喜寅卯巳午  忌申酉(夭) 备注：喜官忌杀混',   
    
    '戊子': '调候：喜丙甲 忌辛  大运：喜辰戌 忌寅卯申酉  备注：喜辰戌坐支', 
    '戊丑': '调候：喜丙甲 忌辛庚  大运：喜寅卯亥子 忌巳午申酉  备注：喜财杀 ',
    '戊寅': '调候：喜丙甲癸 忌壬  大运：喜巳午未 忌亥子甲 ', 
    '戊卯': '调候：喜丙甲癸 忌辛  大运：喜巳午未 忌酉(夭) 备注：喜火',
    '戊辰': '调候：喜甲丙壬 忌癸  大运：喜申酉巳午 忌戌 备注：喜水木财官',    
    '戊巳': '调候：喜甲丙癸 忌戊  大运：喜寅卯亥子  忌申酉巳午 备注：喜财杀',
    '戊午': '调候：喜壬甲丙 忌癸  大运：喜寅卯  忌子  ', 
    '戊未': '调候：喜壬丙甲 忌乙  大运：喜寅卯辰  忌亥子',
    '戊申': '调候：喜丙甲癸 忌庚  大运：喜巳午未  忌亥子丑(灾) 备注：喜财杀',
    '戊酉': '调候：喜丙癸 忌壬  大运：喜巳午  忌亥子卯 备注：喜身强',
    '戊戌': '调候：喜甲癸 忌丁  大运：忌辰 备注：喜财杀',    
    '戊亥': '调候：喜甲丙 忌辛  大运：喜巳午未  忌酉卯辰',      

    '己子': '调候：喜丙甲 忌戊  大运：喜巳未戌 忌寅卯(夭)  备注：忌身弱官杀混', 
    '己丑': '调候：喜丙甲 忌辛己  大运：子亥申酉 忌未  备注：忌比肩',
    '己寅': '调候：喜丙癸 忌壬  大运：喜巳午未 忌丑子(夭)  备注：忌身柔', 
    '己卯': '调候：喜甲癸 忌己  大运：喜巳午未 忌寅(夭) 备注：忌官杀会',
    '己辰': '调候：喜丙壬 忌癸  大运：喜巳午未 忌卯寅丑戌 ',    
    '己巳': '调候：喜癸丙辛 忌戊  大运：喜亥子寅卯  忌申酉 ',
    '己午': '调候：喜癸丙 忌己庚  大运：喜未申寅卯  忌亥子  ', 
    '己未': '调候：喜癸丙 忌乙  大运： 忌丑  备注：喜七杀',
    '己申': '调候：喜丙癸 忌甲  大运：喜巳午未  忌寅卯(夭) 备注：身强',
    '己酉': '调候：喜丙癸 忌辛  大运：喜寅巳午  忌申戌 备注：忌无根(夭)',
    '己戌': '调候：喜甲丙癸 忌丁庚  大运：忌戌 ',    
    '己亥': '调候：喜丙甲 忌己  大运：喜子丑  忌寅卯(夭)  备注：忌无根',   
    
    '庚子': '调候：喜丁丙甲 忌癸  大运：喜寅卯辰 忌午(夭)  备注：喜财杀', 
    '庚丑': '调候：喜丙甲丁 忌辛  大运：喜寅卯巳午 忌未  备注：喜木火 ',
    '庚寅': '调候：喜丙甲 忌癸  大运：喜卯巳酉 忌子丑午(灾) 备注：喜透土', 
    '庚卯': '调候：喜丁甲 忌癸  大运：喜申酉 忌午(夭) 备注：喜身旺',
    '庚辰': '调候：喜甲丁戌 忌癸  大运：喜卯寅亥 忌子(夭) ',    
    '庚巳': '调候：喜壬戊丙 忌丁  大运：喜申酉亥子  忌午(夭) 备注：忌无根，缺水夭',
    '庚午': '调候：喜壬 忌丁  大运：喜寅卯辰巳  忌子(夭)  ', 
    '庚未': '调候：喜丁甲 忌乙戊己  大运：喜寅卯辰巳  忌戌辰丑(凶)',
    '庚申': '调候：喜甲丁 忌辛  大运：喜寅卯巳午  忌酉 备注：忌过旺',
    '庚酉': '调候：喜丁酉 忌癸  大运：喜巳午  忌申 备注：喜七杀',
    '庚戌': '调候：喜甲壬 忌丁  大运：喜巳午未  忌子辰(夭) ',    
    '庚亥': '调候：喜丁丙 忌癸  大运：喜辰巳午  忌卯寅(凶)  备注：喜土',       
    
    '辛子': '调候：喜丙壬 忌癸  大运：喜寅卯巳午 忌亥子  备注：喜丙丁', 
    '辛丑': '调候：喜丙 忌辛  大运：喜巳午未 忌辰戌(夭)  备注：喜丁、土多夭 ',
    '辛寅': '调候：喜己壬 忌丁  大运：喜寅卯辰 忌巳午(夭) 备注：无木则夭', 
    '辛卯': '调候：喜壬 忌庚  大运：喜巳午未 忌申酉(凶) 备注：喜支坐土',
    '辛辰': '调候：喜壬 忌癸  大运：忌戌 ',    
    '辛巳': '调候：喜壬 忌丁  大运：喜寅卯  忌午子亥 备注：忌水多',
    '辛午': '调候：喜壬 忌丁巳  大运：喜亥子寅卯  忌申酉  备注：喜根深', 
    '辛未': '调候：喜壬庚 忌乙  大运：喜寅卯辰  忌申 备注：喜金印',
    '辛申': '调候：喜壬甲 忌己  大运：喜寅卯巳午  忌酉 备注：忌支坐酉',
    '辛酉': '调候：喜壬 忌己  大运：喜巳午未  忌申戌子 备注：喜财杀',
    '辛戌': '调候：喜壬甲 忌丁  大运：忌巳辰 ',    
    '辛亥': '调候：喜壬丙 忌癸  大运：喜巳午未  忌子丑  备注：喜丙官',       
    
    '壬子': '调候：喜丙壬 忌己  大运：喜巳午未 忌亥丑(凶)  备注：喜财杀', 
    '壬丑': '调候：喜丙壬 忌辛己  大运：喜亥子巳午 忌寅卯  备注：喜财 ',
    '壬寅': '调候：喜辛丙 忌丁  大运：喜巳午未 忌申亥子 ', 
    '壬卯': '调候：喜庚辛 忌丙  大运：喜辰巳午未 忌丑亥子 ',
    '壬辰': '调候：喜丙辛 忌癸  大运：喜寅卯 忌申酉  备注：甲乙',    
    '壬巳': '调候：喜辛壬 忌丁  大运：喜申酉  忌午(夭) 备注：忌日主无根',
    '壬午': '调候：喜庚辛壬 忌丁  大运：喜亥申酉  忌戌未  备注：喜从财 ', 
    '壬未': '调候：喜庚辛壬 忌乙丁  大运：忌卯(凶夭)',
    '壬申': '调候：喜丁 忌壬癸  大运：巳午未  忌卯(凶夭) 备注：喜财',
    '壬酉': '调候：喜丙辛 忌乙  大运：忌卯 备注：喜杀忌官',
    '壬戌': '调候：喜辛甲 忌丁  大运：喜巳午  忌寅卯辰',    
    '壬亥': '调候：喜丙 忌辛癸  大运：喜寅卯巳午  忌子丑  备注：喜财出干',    
    
    '癸子': '调候：喜丙壬 忌辛  大运：喜寅卯巳午 忌申酉  备注：喜财官', 
    '癸丑': '调候：喜丙 忌辛  大运：喜寅卯巳午 忌申酉(夭)  备注：喜财印 ',
    '癸寅': '调候：喜辛丙 忌庚  大运：喜巳午未 忌申(夭)  备注：忌官杀混', 
    '癸卯': '调候：喜庚辛 忌癸  大运：喜巳午未 忌申酉(夭)   备注：忌官杀混',
    '癸辰': '调候：喜丙辛 忌癸  大运：喜申酉 忌巳午(灾凶)  备注：忌无根',    
    '癸巳': '调候：喜辛壬 忌丁  大运：喜寅卯辰  忌申酉(灾凶) 备注：喜有根忌七杀',
    '癸午': '调候：喜庚壬辛 忌丁  大运：喜从火财  忌申(无根夭)  备注：忌日主无根 ', 
    '癸未': '调候：喜庚壬辛 忌乙  大运：喜寅卯辰 忌刃忌官',
    '癸申': '调候：喜丁 忌癸  大运：亥子丑  忌寅 备注：忌无财局',
    '癸酉': '调候：喜丙辛 忌癸  大运：喜申未巳午  忌亥子',
    '癸戌': '调候：喜辛甲 忌丁壬  大运：喜寅卯巳午  忌亥(夭凶)',    
    '癸亥': '调候：喜丙 忌乙壬  大运：喜巳午未  忌卯(夭凶) ',  
    
}


ges = {
    
    "木": {
        "寅": "食伤生财：最佳  财格：      印格：无用     杀印相生：夭寿或多疾 官杀：平常   伤官配印：",
        "卯": "食伤生财：最佳  财格：      印格：无用     杀印相生：夭寿或多疾 官杀：佳     伤官配印：",
        "辰": "食伤生财：最佳  财格：较佳  印格：         杀印相生：           官杀：       伤官配印：",
        "巳": "食伤生财：      财格：      印格；婚姻不佳 杀印相生：           官杀：是非多 伤官配印：",   
        "午": "食伤生财：体弱多病  财格：        印格：     杀印相生：    官杀：     伤官配印：",
        "未": "食伤生财：体弱多病  财格：佳      印格：     杀印相生：    官杀：     伤官配印：",
        "申": "食伤生财：无用      财格：佳      印格：最佳 杀印相生：佳  官杀：     伤官配印：",
        "酉": "食伤生财：贫困      财格：佳      印格；最佳 杀印相生：    官杀：最佳  伤官配印：",     
        "戌": "食伤生财：贫困疾    财格：        印格：         杀印相生：    官杀：最佳 伤官配印：",
        "亥": "食伤生财：最佳      财格：        印格：         杀印相生：佳  官杀：     伤官配印：",
        "子": "食伤生财：最佳      财格：        印格：体弱多病 杀印相生：    官杀：     伤官配印：",
        "丑": "食伤生财：最佳      财格：        印格；体弱多病 杀印相生：    官杀：六亲稀少 伤官配印：",  
    },
    
    "火": {
        "寅": "食伤生财：       财格：      		印格：      杀印相生：富而有体  官杀：体弱夭疾   伤官配印：",
        "卯": "食伤生财：       财格：      		印格：      杀印相生：最佳 		官杀：体弱夭疾   伤官配印：",
        "辰": "食伤生财：       财格：      		印格：      杀印相生：最佳      官杀：体弱       伤官配印：",
        "巳": "食伤生财：       财格：最佳  		印格；		杀印相生：          官杀：体弱		 伤官配印：",   
        "午": "食伤生财：       财格：      		印格：     	杀印相生：    		官杀：     		 伤官配印：最佳",
        "未": "食伤生财：       财格：      		印格：     	杀印相生：    		官杀：			 伤官配印：最佳",
        "申": "食伤生财：       财格：佳    		印格：佳 	杀印相生：			官杀：最佳       伤官配印：",
        "酉": "食伤生财：       财格：无印困财引祸  印格；最佳 	杀印相生：    		官杀：是非	     伤官配印：",     
        "戌": "食伤生财：       财格：无印困财引祸  印格：最佳  杀印相生：    		官杀：是非		 伤官配印：",
        "亥": "食伤生财：无用   财格：        		印格：		杀印相生：			官杀：无印凶有印贵     伤官配印：",
        "子": "食伤生财：无用   财格：        		印格：		杀印相生：    		官杀：无印凶有印贵     伤官配印：",
        "丑": "食伤生财：头面疾 财格：        		印格； 		杀印相生：    		官杀： 			伤官配印：",  
    },
    
    "土": {
        "寅": "食伤生财：       财格：无用    		印格：最佳 	杀印相生： 官杀：无用   伤官配印：",
        "卯": "食伤生财：       财格：无用      	印格：最佳 	杀印相生： 官杀：    伤官配印：",
        "辰": "食伤生财：       财格：      		印格：最佳 	杀印相生： 官杀：体弱或夭折       伤官配印：",
        "巳": "食伤生财：       财格：最佳  		印格；佳 	杀印相生： 官杀：体弱多病		 伤官配印：",   
        "午": "食伤生财：       财格：大富  		印格：无用  杀印相生： 官杀：聪明     		 伤官配印： ",
        "未": "食伤生财：       财格：大富  		印格：无用  杀印相生： 官杀：聪明		 伤官配印： ",
        "申": "食伤生财：       财格：独喜   		印格：  	杀印相生： 官杀：           伤官配印：",
        "酉": "食伤生财：富寿   财格：平常          印格；平常 	杀印相生： 官杀： 	     伤官配印：",     
        "戌": "食伤生财：       财格：              印格：独印  杀印相生： 官杀： 		 伤官配印：",
        "亥": "食伤生财：孤寒   财格：        		印格：独印	杀印相生： 官杀：      伤官配印：",
        "子": "食伤生财：       财格：多疾夭病 		印格：独印  杀印相生： 官杀：无用   伤官配印：",
        "丑": "食伤生财：贫孤疾 财格：无用    		印格；独印  杀印相生： 官杀：无用   伤官配印：",  
    },

    "金": {                                                        
        "寅": "食伤生财：无用   财格：     印格：    	杀印相生：   官杀：婚姻不佳   伤官配印：无用",
        "卯": "食伤生财：       财格：     印格：独印 	杀印相生：   官杀：不贫则多病    伤官配印：",
        "辰": "食伤生财：       财格：     印格：独印 	杀印相生：   官杀：不贫则多病       伤官配印：",
        "巳": "食伤生财：孤贫劳 财格：     印格；最佳 	杀印相生：佳   官杀：体弱多病		 伤官配印：",   
        "午": "食伤生财：孤贫劳 财格：     印格：最佳   杀印相生：佳   官杀：体弱多病     		 伤官配印： ",
        "未": "食伤生财：无用   财格：     印格：佳     杀印相生：佳   官杀：身体有疾		 伤官配印： ",
        "申": "食伤生财：最佳   财格：     印格：  	    杀印相生：   官杀：           伤官配印：",
        "酉": "食伤生财：最佳   财格：     印格；    	杀印相生：   官杀： 	     伤官配印：",     
        "戌": "食伤生财：       财格：无用 印格：       杀印相生：   官杀： 		 伤官配印：",
        "亥": "食伤生财：       财格：     印格：独喜夜生 杀印相生  ： 官杀：忌书生      伤官配印：",
        "子": "食伤生财：       财格：     印格：独印  杀印相生：佳  官杀：佳   伤官配印：",
        "丑": "食伤生财：       财格：佳   印格；独印  杀印相生：佳  官杀：佳   伤官配印：",  
    },  
    
    "水": {                                                        
        "寅": "食伤生财：    财格：最佳     印格：    	杀印相生：   官杀：无用   伤官配印：",
        "卯": "食伤生财：       财格：是非多     印格：无用 	杀印相生：   官杀：最佳    伤官配印：",
        "辰": "食伤生财：       财格：是非多     印格：无用 	杀印相生：   官杀：最佳       伤官配印：",
        "巳": "食伤生财：  财格：     印格；无印夭 	杀印相生：    官杀： 		 伤官配印：",   
        "午": "食伤生财：  财格：体弱多病     印格：亲属孤单   杀印相生：    官杀：最佳     		 伤官配印： ",
        "未": "食伤生财：    财格：体弱多病     印格：亲属孤单     杀印相生：    官杀：最佳		 伤官配印： ",
        "申": "食伤生财：    财格：无用     印格：佳  	    杀印相生：   官杀：佳           伤官配印：",
        "酉": "食伤生财：    财格：     印格；无用    	杀印相生：   官杀： 	     伤官配印：最佳",     
        "戌": "食伤生财：       财格： 印格： 无用      杀印相生：   官杀： 		 伤官配印：最佳",
        "亥": "食伤生财： 无用      财格：最佳     印格：  杀印相生  ： 官杀：忌书生      伤官配印：",
        "子": "食伤生财：无用       财格：最佳     印格：   杀印相生：   官杀：佳   伤官配印：",
        "丑": "食伤生财：食神制杀贵       财格：佳   印格；   杀印相生：   官杀：佳   伤官配印：",  
    },  
}

siling =  {                                                
        "寅": "立春后戊土七日，丙火七日，甲木十六日 立春、雨水。",
        "卯": "惊蛰后甲木十日，乙木二十日。 惊蛰、春分。",
        "辰": "清明后乙木九日，癸水三日，戊土十八日。清明、谷雨。",   
        "巳": "立夏后戊土五日，庚金九日，丙火十六日。立夏、小满。",   
        "午": "芒种后丙火十日，己土九日，丁火十一日 芒种、夏至。 ",
        "未": "小暑后丁火九日，乙木三日，己土十八日。小暑、大署。 ",
        "申": "立秋后戊土十日，壬水三日，庚金十七日。立秋、处暑。",
        "酉": "白露后庚金十日，辛金二十日。 白露、秋分。",     
        "戌": "寒露后辛金九日，丁火三日，戊土十八日。寒露、霜降。",
        "亥": "立冬后戊土七日，甲木五日，壬水十八日。立冬、小雪。",
        "子": "大雪后壬水十日，癸水二十日。 大雪、冬至。",
        "丑": "小寒后癸水九日，辛金三日，己土十八日。小寒、大寒。",  
    }

xiuqius = {
    "寅": {
        "金": "囚",
        "木": "旺",
        "水": "休",
        "火": "相",
        "土": "死"
    },
    "卯": {
        "金": "囚",
        "木": "旺",
        "水": "休",
        "火": "相",
        "土": "死"
    },
    "辰": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "巳": {
        "金": "死",
        "木": "休",
        "水": "囚",
        "火": "旺",
        "土": "相"
    },
    "午": {
        "金": "死",
        "木": "休",
        "水": "囚",
        "火": "旺",
        "土": "相"
    },
    "未": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "申": {
        "金": "旺",
        "木": "死",
        "水": "相",
        "火": "囚",
        "土": "休"
    },
    "酉": {
        "金": "旺",
        "木": "死",
        "水": "相",
        "火": "囚",
        "土": "休"
    },
    "戌": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    },
    "亥": {
        "金": "休",
        "木": "相",
        "水": "旺",
        "火": "死",
        "土": "囚"
    },
    "子": {
        "金": "休",
        "木": "相",
        "水": "旺",
        "火": "死",
        "土": "囚"
    },
    "丑": {
        "金": "相",
        "木": "囚",
        "水": "死",
        "火": "休",
        "土": "旺"
    }
}